<template>
    <div>
        正则表达式
JavaScript中的正则表达式RegExp对象，或者RegExp()构造函数来执行。
大部分字符在正则表达式中，就是字面的含义，比如/a/匹配a，/b/匹配b，/ab/就是匹配ab。如果在正则表达式之中，某个字符只表示它字面的含义（就像前面的a和b），那么它们就叫做“字面量字符”
元字符：
除了字面量字符以外，还有一部分字符有特殊含义，不代表字面的意思。它们叫做“元字符”。
正则表达式中，需要反斜杠转义的，一共有12个字符：^、.、[、$、(、)、|、*、+、?、{和\。需要特别注意的是，如果使用RegExp方法生成正则对象，转义需要使用两个斜杠，因为字符串内部会先转义一次。
(new RegExp(‘1\\+1’)).test(‘1+1’)//true
点字符（.）匹配除回车（\r）、换行(\n) 、行分隔符（\u2028）和段分隔符（\u2029）以外的所有字符。注意，对于码点大于0xFFFF字符，点字符不能正确匹配，会认为这是两个字符。
/c.t/，c.t匹配c和t之间包含任意一个字符的情况，只要这三个字符在同一行，比如cat、c2t、c-t等等，但是不匹配coot
^表示字符串的开始位置，$表示字符串结束位置
/^test$/表示test开始，test结束，’test’匹配，’test test’不匹配
选择符|表示或，/11|22/表示匹配11或22。可以多个一起使用，/11|22/33/
选择符会包括它前后的多个字符，比如/ab|cd/指的是匹配ab或者cd，而不是指匹配b或者c。如果想修改这个行为，可以使用圆括号。/a(b|c)d/,指ad之间有一个b或c
正则表达式中的特殊字符，需要使用\来表示。
正则表达式对一些不能打印的特殊字符，提供了表达方法。
\cx表示ctrl-[x]，其中的x是A-Z之中任一个英文字母，用来匹配控制字符。
[\b]匹配退格键(U+0008)，不要与\b混淆。
\n匹配换行键。
\r匹配回车键。
\t匹配制表符 tab（U+0009）。
\v匹配垂直制表符（U+000B）。
\f匹配换页符（U+000C）。
\o匹配null字符（U+0000）。
\xhh匹配一个以两位十六进制数（\x00-\xff）表示的字符。
\uhhhh匹配一个以四位十六进制数（\u0000-\uffff）表示的 Unicode 字符。

[]方括号，表示匹配方括号里面任意一个字符，如[abc]，表示匹配a或b或c，目标字符串包含其中一个字符，都返回true。
脱字符^，在[]中第一个为^，则表示匹配除了[]中的字符的其他字符。如[^abc]，匹配除a,b,c之外的其他字符。
如果方括号内没有其他字符，即只有[^]，就表示匹配一切字符，其中包括换行符。相比之下，点号作为元字符（.）是不包括换行符的。注意，脱字符只有在字符类的第一个位置才有特殊含义，否则就是字面含义。
连字符（-）
某些情况下，对于连续序列的字符，连字符（-）用来提供简写形式，表示字符的连续范围，必须写在方括号[]之内有效。比如，[abc]可以写成[a-c]，[0123456789]可以写成[0-9]，同理[A-Z]表示26个大写字母。

预定义模式
预定义模式指的是某些常见模式的简写方式。
\d 匹配0-9之间的任一数字，相当于[0-9]。
\D 匹配所有0-9以外的字符，相当于[^0-9]。
\w 匹配任意的字母、数字和下划线，相当于[A-Za-z0-9_]。
\W 除所有字母、数字和下划线以外的字符，相当于[^A-Za-z0-9_]。
\s 匹配空格（包括换行符、制表符、空格符等），相等于[ \t\r\n\v\f]。
\S 匹配非空格的字符，相当于[^ \t\r\n\v\f]。
\b 匹配词的边界。
\B 匹配非词边界，即在词的内部

    </div>
</template>